tutorials/pnpMultiFoam/twoDRandomFieldCyclic/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/initialConditions";

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinitial;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    lowerWall
    {
        type            cyclic;
    }
    upperWall
    {
        type            cyclic;
    }
    emptyWall
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
