tutorials/pnpMultiFoam/twoDRandomFieldCyclic/0/fluid/r
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/fluid";
    object      r;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    lowerWall
    {
        type            cyclic;
    }
    upperWall
    {
        type            cyclic;
    }
    emptyWall
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
