tutorials/pnpMultiFoam/twoDRandomFieldCyclic/constant/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosity       1e-6;
Tinitial        293;
c0              0e-3;
cCl             1e-8;
cNa             1e-8;
cFluid          #calc "$c0+$cCl";
cSolid          #calc "$c0+$cNa";
Ds              1e-12;
Df              1e-9;
Uinitial        (0 0 0);
V0              1e-2;
epsilonRSolid   1e4;
epsilonRFluid   78.5;
epsilon0        8.8541878176e-12;
epsilonSolid    #calc "$epsilon0*$epsilonRSolid";
epsilonFluid    #calc "$epsilon0*$epsilonRFluid";

// ************************************************************************* //
