tutorials/pnpMultiFoam/twoDRandomFieldCyclic/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/blockMeshDict"

actions
(
    {
        name    cs;
        type    cellSet;
        action  new;
        source  fieldToCell;
        sourceInfo
        {
            field r;
            min -0.5;
            max 0.5;
        }

    }
    {
        name    cf;
        type    cellSet;
        action  new;
        source  fieldToCell;
        sourceInfo
        {
            field r;
            min 0.5;
            max 1.5;
        }
        
    }

    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo { set cf; }
    }

    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo { set cs; }
    }
);

// ************************************************************************* //
